zjcszn/mcu-demo/0. zjcszn/st/stm32f4/Middleware/lwip/ports/drv/MAC_STM32F4XX.c
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
/* Ethernet Pin definitions */
static const ETH_PIN eth_pins[] = {
    {MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, 0U},  /* MII, RMII */
    {MX_ETH_MDIO_GPIOx, MX_ETH_MDIO_GPIO_Pin, 0U},  /* MII, RMII */
    {MX_ETH_TXD0_GPIOx, MX_ETH_TXD0_GPIO_Pin, 0U},  /* MII, RMII */
    {MX_ETH_TXD1_GPIOx, MX_ETH_TXD1_GPIO_Pin, 0U},  /* MII, RMII */
    {MX_ETH_RXD0_GPIOx, MX_ETH_RXD0_GPIO_Pin, 0U},  /* MII, RMII */
    {MX_ETH_RXD1_GPIOx, MX_ETH_RXD1_GPIO_Pin, 0U},  /* MII, RMII */
    {MX_ETH_TX_EN_GPIOx, MX_ETH_TX_EN_GPIO_Pin, 0U},  /* MII, RMII */
#if (ETH_MII)
    { MX_ETH_TXD2_GPIOx, MX_ETH_TXD2_GPIO_Pin,       0U },  /* MII, ---- */
    { MX_ETH_TXD3_GPIOx, MX_ETH_TXD3_GPIO_Pin,       0U },  /* MII, ---- */
    { MX_ETH_RXD2_GPIOx, MX_ETH_RXD2_GPIO_Pin,       0U },  /* MII, ---- */
    { MX_ETH_RXD3_GPIOx, MX_ETH_RXD3_GPIO_Pin,       0U },  /* MII, ---- */
    { MX_ETH_TX_CLK_GPIOx, MX_ETH_TX_CLK_GPIO_Pin,   0U },  /* MII, ---- */
    { MX_ETH_RX_CLK_GPIOx, MX_ETH_RX_CLK_GPIO_Pin,   0U },  /* MII, ---- */
    { MX_ETH_CRS_GPIOx,   MX_ETH_CRS_GPIO_Pin,       0U },  /* MII, ---- */
    { MX_ETH_COL_GPIOx, MX_ETH_COL_GPIO_Pin,         0U },  /* MII, ---- */
    { MX_ETH_RX_DV_GPIOx, MX_ETH_RX_DV_GPIO_Pin,     0U },  /* MII, ---- */
    { MX_ETH_RX_ER_GPIOx, MX_ETH_RX_ER_GPIO_Pin,     0U },  /* MII, ---- */
#else
    {MX_ETH_CRS_DV_GPIOx, MX_ETH_CRS_DV_GPIO_Pin, 0U},  /* ---, RMII */
    {MX_ETH_REF_CLK_GPIOx, MX_ETH_REF_CLK_GPIO_Pin, 0U},  /* ---, RMII */
#endif
};
#endif

/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion = {
    ARM_ETH_MAC_API_VERSION,
    ARM_ETH_MAC_DRV_VERSION
};

/* Driver Capabilities */
static const ARM_ETH_MAC_CAPABILITIES DriverCapabilities = {
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_rx_ip4  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_rx_ip6  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_rx_udp  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_rx_tcp  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_rx_icmp */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_tx_ip4  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_tx_ip6  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_tx_udp  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_tx_tcp  */
    (EMAC_CHECKSUM_OFFLOAD != 0) ? 1U : 0U,   /* checksum_offload_tx_icmp */
    (ETH_MII != 0) ?
    ARM_ETH_INTERFACE_MII :
    ARM_ETH_INTERFACE_RMII,                   /* media_interface          */
    0U,                                       /* mac_address              */
    1U,                                       /* event_rx_frame           */
    1U,                                       /* event_tx_frame           */
    1U,                                       /* event_wakeup             */
    (EMAC_TIME_STAMP != 0) ? 1U : 0U,         /* precision_timer          */
#if (defined(ARM_ETH_MAC_API_VERSION) && (ARM_ETH_MAC_API_VERSION >= 0x201U))
    0U                                        /* reserved bits            */
#endif
};

/* Local variables */
static EMAC_CTRL Emac;

static RX_Desc rx_desc[NUM_RX_BUF];
static TX_Desc tx_desc[NUM_TX_BUF];
static uint32_t rx_buf[NUM_RX_BUF][ETH_BUF_SIZE >> 2];
static uint32_t tx_buf[NUM_TX_BUF][ETH_BUF_SIZE >> 2];

#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)

/**
  \fn          void Enable_GPIO_Clock (const GPIO_TypeDef *port)
  \brief       Enable GPIO clock
*/
static void Enable_GPIO_Clock(const GPIO_TypeDef *GPIOx) {
    if (GPIOx == GPIOA) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
    } else if (GPIOx == GPIOB) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
    } else if (GPIOx == GPIOC) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
    }
#if defined(GPIOD)
    else if (GPIOx == GPIOD) {
        __HAL_RCC_GPIOD_CLK_ENABLE();
    }
#endif
#if defined(GPIOE)
    else if (GPIOx == GPIOE) {
        __HAL_RCC_GPIOE_CLK_ENABLE();
    }
#endif
#if defined(GPIOF)
    else if (GPIOx == GPIOF) {
        __HAL_RCC_GPIOF_CLK_ENABLE();
    }
#endif
#if defined(GPIOG)
    else if (GPIOx == GPIOG) {
        __HAL_RCC_GPIOG_CLK_ENABLE();
    }
#endif
#if defined(GPIOH)
    else if (GPIOx == GPIOH) {
        __HAL_RCC_GPIOH_CLK_ENABLE();
    }
#endif
#if defined(GPIOI)
    else if (GPIOx == GPIOI) {
        __HAL_RCC_GPIOI_CLK_ENABLE();
    }
#endif
#if defined(GPIOJ)
    else if (GPIOx == GPIOJ) { __HAL_RCC_GPIOJ_CLK_ENABLE(); }
#endif
#if defined(GPIOK)
    else if (GPIOx == GPIOK) { __HAL_RCC_GPIOK_CLK_ENABLE(); }
#endif
}

#endif

/**
  \fn          void init_rx_desc (void)
  \brief       Initialize Rx DMA descriptors.
  \return      none.
*/
static void init_rx_desc(void) {
    uint32_t i, next;
    
    for (i = 0U; i < NUM_RX_BUF; i++) {
        rx_desc[i].Stat = DMA_RX_OWN;
        rx_desc[i].Ctrl = DMA_RX_RCH | ETH_BUF_SIZE;
        rx_desc[i].Addr = (uint8_t *)&rx_buf[i];
        next = i + 1U;
        if (next == NUM_RX_BUF) {
            next = 0U;
        }
        rx_desc[i].Next = &rx_desc[next];
    }
    
    ETH->DMARDLAR = (uint32_t)&rx_desc[0];
    Emac.rx_index = 0U;
}

/**
  \fn          void init_tx_desc (void)
  \brief       Initialize Tx DMA descriptors.
  \return      none.
*/
static void init_tx_desc(void) {
    uint32_t i, next;
    
    for (i = 0; i < NUM_TX_BUF; i++) {
        tx_desc[i].CtrlStat = DMA_TX_TCH | DMA_TX_LS | DMA_TX_FS;
        tx_desc[i].Addr = (uint8_t *)&tx_buf[i];
        next = i + 1U;
        if (next == NUM_TX_BUF) {
            next = 0U;
        }
        tx_desc[i].Next = &tx_desc[next];
    }
    ETH->DMATDLAR = (uint32_t)&tx_desc[0];
    Emac.tx_index = 0U;
}

/**
  \fn          void init_dma (void)
  \brief       Initialize DMA.
  \return      none.
*/
static void init_dma(void) {
    
    if ((Emac.flags & EMAC_FLAG_DMA_INIT) == 0) {
        Emac.flags |= EMAC_FLAG_DMA_INIT;

#if ((EMAC_CHECKSUM_OFFLOAD != 0) || (EMAC_TIME_STAMP != 0))
        /* Enhanced descriptor enable */
        ETH->DMABMR |= ETH_DMABMR_EDE;
#endif
        
        /* Initialize DMA Descriptors */
        init_rx_desc();
        init_tx_desc();
        
