zjcszn/mcu-demo/0. zjcszn/st/stm32f4/Middleware/lwip/ports/drv/MAC_STM32F4XX.c
        /* Enable Rx interrupts */
        ETH->DMASR = 0xFFFFFFFFU;
        ETH->DMAIER = ETH_DMAIER_NISE | ETH_DMAIER_RIE | ETH_DMAIER_TIE;
    }
}

/**
  \fn          uint32_t crc32_8bit_rev (uint32_t crc32, uint8_t val)
  \brief       Calculate 32-bit CRC (Polynomial: 0x04C11DB7, data bit-reversed).
  \param[in]   crc32  CRC initial value
  \param[in]   val    Input value
  \return      Calculated CRC value
*/
static uint32_t crc32_8bit_rev(uint32_t crc32, uint8_t val) {
    uint32_t n;
    
    crc32 ^= __RBIT(val);
    for (n = 8; n; n--) {
        if (crc32 & 0x80000000U) {
            crc32 <<= 1;
            crc32 ^= 0x04C11DB7U;
        } else {
            crc32 <<= 1;
        }
    }
    return (crc32);
}

/**
  \fn          uint32_t crc32_data (const uint8_t *data, uint32_t len)
  \brief       Calculate standard 32-bit Ethernet CRC.
  \param[in]   data  Pointer to buffer containing the data
  \param[in]   len   Data length in bytes
  \return      Calculated CRC value
*/
static uint32_t crc32_data(const uint8_t *data, uint32_t len) {
    uint32_t cnt, crc;
    
    crc = 0xFFFFFFFFU;
    for (cnt = len; cnt; cnt--) {
        crc = crc32_8bit_rev(crc, *data++);
    }
    return (crc ^ 0xFFFFFFFFU);
}


/* Ethernet Driver functions */

/**
  \fn          ARM_DRIVER_VERSION GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION GetVersion(void) {
    return DriverVersion;
}

/**
  \fn          ARM_ETH_MAC_CAPABILITIES GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_ETH_MAC_CAPABILITIES
*/
static ARM_ETH_MAC_CAPABILITIES GetCapabilities(void) {
    return DriverCapabilities;
}

/**
  \fn          int32_t Initialize (ARM_ETH_MAC_SignalEvent_t cb_event)
  \brief       Initialize Ethernet MAC Device.
  \param[in]   cb_event  Pointer to \ref ARM_ETH_MAC_SignalEvent
  \return      \ref execution_status
*/
static int32_t Initialize(ARM_ETH_MAC_SignalEvent_t cb_event) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
    GPIO_InitTypeDef GPIO_InitStruct;
    const ETH_PIN *io;
#endif
    
    /* Enable SYSCFG clock */
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

#if (ETH_MII == 0)
    SYSCFG->PMC |= SYSCFG_PMC_MII_RMII_SEL;
#else
    SYSCFG->PMC &= ~SYSCFG_PMC_MII_RMII_SEL;
#endif

#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
    /* Configure Ethernet pins */
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
    
    for (io = eth_pins; io != &eth_pins[sizeof(eth_pins) / sizeof(ETH_PIN)]; io++) {
        Enable_GPIO_Clock(io->port);
        GPIO_InitStruct.Pin = io->pin;
        HAL_GPIO_Init(io->port, &GPIO_InitStruct);
    }
#else
    heth.Instance = ETH;
#endif
    
    /* Clear control structure */
    memset((void *)&Emac, 0, sizeof(EMAC_CTRL));
    
    Emac.cb_event = cb_event;
    Emac.flags = EMAC_FLAG_INIT;
    
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t Uninitialize (void)
  \brief       De-initialize Ethernet MAC Device.
  \return      \ref execution_status
*/
static int32_t Uninitialize(void) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
    const ETH_PIN *io;
    
    /* Unconfigure ethernet pins */
    for (io = eth_pins; io != &eth_pins[sizeof(eth_pins) / sizeof(ETH_PIN)]; io++) {
        HAL_GPIO_DeInit(io->port, io->pin);
    }
#else
    heth.Instance = NULL;
#endif
    Emac.flags &= ~EMAC_FLAG_INIT;
    
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t PowerControl (ARM_POWER_STATE state)
  \brief       Control Ethernet MAC Device Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t PowerControl(ARM_POWER_STATE state) {
    uint32_t hclk, clkdiv;
    
    if ((state != ARM_POWER_OFF) &&
        (state != ARM_POWER_FULL) &&
        (state != ARM_POWER_LOW)) {
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    }
    
    switch (state) {
        case ARM_POWER_OFF:
            /* Enable Ethernet clocks */
            __HAL_RCC_ETHMAC_CLK_ENABLE();
            __HAL_RCC_ETHMACTX_CLK_ENABLE();
            __HAL_RCC_ETHMACRX_CLK_ENABLE();
#if (EMAC_TIME_STAMP)
            __HAL_RCC_ETHMACPTP_CLK_ENABLE();
#endif
            
            /* Reset Ethernet MAC peripheral */
            __HAL_RCC_ETHMAC_FORCE_RESET();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __HAL_RCC_ETHMAC_RELEASE_RESET();

#if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
            if (heth.Instance != NULL) {
              HAL_ETH_MspDeInit (&heth);
            }
#else
            /* Disable ethernet interrupts */
            NVIC_DisableIRQ(ETH_IRQn);
            ETH->DMAIER = 0U;
            ETH->PTPTSCR = 0U;
            
            /* Disable Ethernet clocks */
            __HAL_RCC_ETHMAC_CLK_DISABLE();
            __HAL_RCC_ETHMACTX_CLK_DISABLE();
            __HAL_RCC_ETHMACRX_CLK_DISABLE();
#if (EMAC_TIME_STAMP)
            __HAL_RCC_ETHMACPTP_CLK_DISABLE();
#endif
#endif
            
            Emac.flags &= ~(EMAC_FLAG_POWER | EMAC_FLAG_DMA_INIT);
            break;
        
        case ARM_POWER_LOW:
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        
        case ARM_POWER_FULL:
            if ((Emac.flags & EMAC_FLAG_INIT) == 0U) {
                /* Driver not initialized */
                return ARM_DRIVER_ERROR;
            }
            if ((Emac.flags & EMAC_FLAG_POWER) != 0U) {
                /* Driver already powered */
                break;
            }
#if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
                HAL_ETH_MspInit (&heth);
#else
            /* Enable Ethernet clocks */
            __HAL_RCC_ETHMAC_CLK_ENABLE();
            __HAL_RCC_ETHMACTX_CLK_ENABLE();
            __HAL_RCC_ETHMACRX_CLK_ENABLE();
#if (EMAC_TIME_STAMP)
            __HAL_RCC_ETHMACPTP_CLK_ENABLE();
#endif
#endif
            
            /* Reset Ethernet MAC peripheral */
            __HAL_RCC_ETHMAC_FORCE_RESET();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __HAL_RCC_ETHMAC_RELEASE_RESET();
            
            /* MDC clock range selection */
            hclk = HAL_RCC_GetHCLKFreq();
            
