zjcszn/mcu-demo/0. zjcszn/st/stm32f4/Middleware/lwip/ports/drv/MAC_STM32F4XX.c
            if (hclk >= 150000000U) {
                clkdiv = ETH_MACMIIAR_CR_Div102;
            } else if (hclk >= 100000000U) {
                clkdiv = ETH_MACMIIAR_CR_Div62;
            } else if (hclk >= 60000000U) {
                clkdiv = ETH_MACMIIAR_CR_Div42;
            } else if (hclk >= 35000000U) {
                clkdiv = ETH_MACMIIAR_CR_Div26;
            } else if (hclk >= 25000000U) {
                clkdiv = ETH_MACMIIAR_CR_Div16;
            } else {
                /* HCLK is too slow for Ethernet */
                return (ARM_DRIVER_ERROR);
            }
            ETH->MACMIIAR = clkdiv;
            
            /* Initialize MAC configuration */
            ETH->MACCR = ETH_MACCR_ROD | 0x00008000U;
            
            /* Initialize Filter registers */
            ETH->MACFFR = ETH_MACFFR_BFD;
            ETH->MACFCR = ETH_MACFCR_ZQPD;
            
            /* Initialize Address registers */
            ETH->MACA0HR = 0U;
            ETH->MACA0LR = 0U;
            ETH->MACA1HR = 0U;
            ETH->MACA1LR = 0U;
            ETH->MACA2HR = 0U;
            ETH->MACA2LR = 0U;
            ETH->MACA3HR = 0U;
            ETH->MACA3LR = 0U;
            
            /* Mask timestamp interrupts */
            ETH->MACIMR |= ETH_MACIMR_TSTIM | ETH_MACIMR_PMTIM;

#if (EMAC_TIME_STAMP)
            /* Set clock accuracy to 20ns (50MHz) or 50ns (20MHz) */
            if (hclk >= 51000000) {
              ETH->PTPSSIR = 20;
              ETH->PTPTSAR = (50000000ull << 32) / hclk;
            }
            else {
              ETH->PTPSSIR = 50;
              ETH->PTPTSAR = (20000000ull << 32) / hclk;
            }

            ETH->PTPTSCR = ETH_PTPTSSR_TSSIPV4FE | ETH_PTPTSSR_TSSIPV6FE | ETH_PTPTSSR_TSSSR |
                                                                           ETH_PTPTSCR_TSARU |
                                                                           ETH_PTPTSCR_TSFCU |
                                                                           ETH_PTPTSCR_TSE;
            Emac.tx_ts_index  = 0U;
#endif
            
            /* Disable MMC interrupts */
            ETH->MMCTIMR = ETH_MMCTIMR_TGFM | ETH_MMCTIMR_TGFMSCM | ETH_MMCTIMR_TGFSCM;
            ETH->MMCRIMR = ETH_MMCRIMR_RGUFM | ETH_MMCRIMR_RFAEM | ETH_MMCRIMR_RFCEM;

#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
            NVIC_SetPriority(ETH_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
            NVIC_ClearPendingIRQ(ETH_IRQn);
            NVIC_EnableIRQ(ETH_IRQn);
#endif
            
            Emac.frame_end = NULL;
            Emac.flags |= EMAC_FLAG_POWER;
            break;
    }
    
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t GetMacAddress (ARM_ETH_MAC_ADDR *ptr_addr)
  \brief       Get Ethernet MAC Address.
  \param[in]   ptr_addr  Pointer to address
  \return      \ref execution_status
*/
static int32_t GetMacAddress(ARM_ETH_MAC_ADDR *ptr_addr) {
    uint32_t val;
    
    if (ptr_addr == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    
    val = ETH->MACA0HR;
    ptr_addr->b[5] = (uint8_t)(val >> 8);
    ptr_addr->b[4] = (uint8_t)(val);
    val = ETH->MACA0LR;
    ptr_addr->b[3] = (uint8_t)(val >> 24);
    ptr_addr->b[2] = (uint8_t)(val >> 16);
    ptr_addr->b[1] = (uint8_t)(val >> 8);
    ptr_addr->b[0] = (uint8_t)(val);
    
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SetMacAddress (const ARM_ETH_MAC_ADDR *ptr_addr)
  \brief       Set Ethernet MAC Address.
  \param[in]   ptr_addr  Pointer to address
  \return      \ref execution_status
*/
static int32_t SetMacAddress(const ARM_ETH_MAC_ADDR *ptr_addr) {
    
    if (ptr_addr == NULL) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    
    /* Set Ethernet MAC Address registers */
    ETH->MACA0HR = ((uint32_t)ptr_addr->b[5] << 8) | (uint32_t)ptr_addr->b[4];
    ETH->MACA0LR = ((uint32_t)ptr_addr->b[3] << 24) | ((uint32_t)ptr_addr->b[2] << 16) |
        ((uint32_t)ptr_addr->b[1] << 8) | (uint32_t)ptr_addr->b[0];
    
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SetAddressFilter (const ARM_ETH_MAC_ADDR *ptr_addr,
                                               uint32_t          num_addr)
  \brief       Configure Address Filter.
  \param[in]   ptr_addr  Pointer to addresses
  \param[in]   num_addr  Number of addresses to configure
  \return      \ref execution_status
*/
static int32_t SetAddressFilter(const ARM_ETH_MAC_ADDR *ptr_addr, uint32_t num_addr) {
    uint32_t crc;
    
    if ((ptr_addr == NULL) && (num_addr != 0)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    
    /* Use unicast address filtering for first 3 MAC addresses */
    ETH->MACFFR &= ~(ETH_MACFFR_HPF | ETH_MACFFR_HM);
    ETH->MACHTHR = 0U;
    ETH->MACHTLR = 0U;
    
    if (num_addr == 0U) {
        ETH->MACA1HR = 0U;
        ETH->MACA1LR = 0U;
        ETH->MACA2HR = 0U;
        ETH->MACA2LR = 0U;
        ETH->MACA3HR = 0U;
        ETH->MACA3LR = 0U;
        return ARM_DRIVER_OK;
    }
    
    ETH->MACA1HR = ((uint32_t)ptr_addr->b[5] << 8) | (uint32_t)ptr_addr->b[4] | ETH_MACA1HR_AE;
    ETH->MACA1LR = ((uint32_t)ptr_addr->b[3] << 24) | ((uint32_t)ptr_addr->b[2] << 16) |
        ((uint32_t)ptr_addr->b[1] << 8) | (uint32_t)ptr_addr->b[0];
    num_addr--;
    if (num_addr == 0U) {
        ETH->MACA2HR = 0U;
        ETH->MACA2LR = 0U;
        ETH->MACA3HR = 0U;
        ETH->MACA3LR = 0U;
        return ARM_DRIVER_OK;
    }
    ptr_addr++;
    
    ETH->MACA2HR = ((uint32_t)ptr_addr->b[5] << 8) | (uint32_t)ptr_addr->b[4] | ETH_MACA2HR_AE;
    ETH->MACA2LR = ((uint32_t)ptr_addr->b[3] << 24) | ((uint32_t)ptr_addr->b[2] << 16) |
        ((uint32_t)ptr_addr->b[1] << 8) | (uint32_t)ptr_addr->b[0];
    num_addr--;
    if (num_addr == 0U) {
        ETH->MACA3HR = 0U;
        ETH->MACA3LR = 0U;
        return ARM_DRIVER_OK;
    }
    ptr_addr++;
    
