zjcszn/mcu-demo/0. zjcszn/st/stm32f4/Middleware/lwip/ports/drv/MAC_STM32F4XX.c
    ETH->MACA3HR = ((uint32_t)ptr_addr->b[5] << 8) | (uint32_t)ptr_addr->b[4] | ETH_MACA3HR_AE;
    ETH->MACA3LR = ((uint32_t)ptr_addr->b[3] << 24) | ((uint32_t)ptr_addr->b[2] << 16) |
        ((uint32_t)ptr_addr->b[1] << 8) | (uint32_t)ptr_addr->b[0];
    num_addr--;
    if (num_addr == 0U) {
        return ARM_DRIVER_OK;
    }
    ptr_addr++;
    
    /* Calculate 64-bit Hash table for remaining MAC addresses */
    for (; num_addr; ptr_addr++, num_addr--) {
        crc = crc32_data(&ptr_addr->b[0], 6U) >> 26;
        if (crc & 0x20U) {
            ETH->MACHTHR |= (1U << (crc & 0x1FU));
        } else {
            ETH->MACHTLR |= (1U << crc);
        }
    }
    /* Enable both, unicast and hash address filtering */
    ETH->MACFFR |= ETH_MACFFR_HPF | ETH_MACFFR_HM;
    
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SendFrame (const uint8_t *frame, uint32_t len, uint32_t flags)
  \brief       Send Ethernet frame.
  \param[in]   frame  Pointer to frame buffer with data to send
  \param[in]   len    Frame buffer length in bytes
  \param[in]   flags  Frame transmit flags (see ARM_ETH_MAC_TX_FRAME_...)
  \return      \ref execution_status
*/
static int32_t SendFrame(const uint8_t *frame, uint32_t len, uint32_t flags) {
    uint8_t *dst = Emac.frame_end;
    uint32_t ctrl;
    
    if ((frame == NULL) || (len == 0U)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    
    if (dst == NULL) {
        /* Start of a new transmit frame */
        if (tx_desc[Emac.tx_index].CtrlStat & DMA_TX_OWN) {
            /* Transmitter is busy, wait */
            return ARM_DRIVER_ERROR_BUSY;
        }
        dst = tx_desc[Emac.tx_index].Addr;
        tx_desc[Emac.tx_index].Size = len;
    } else {
        /* Sending data fragments in progress */
        tx_desc[Emac.tx_index].Size += len;
    }
    /* Fast-copy data fragments to ETH-DMA buffer */
    for (; len > 7U; dst += 8, frame += 8, len -= 8U) {
        __UNALIGNED_UINT32_WRITE(&dst[0], __UNALIGNED_UINT32_READ(&frame[0]));
        __UNALIGNED_UINT32_WRITE(&dst[4], __UNALIGNED_UINT32_READ(&frame[4]));
    }
    /* Copy remaining 7 bytes */
    for (; len > 1U; dst += 2, frame += 2, len -= 2U) {
        __UNALIGNED_UINT16_WRITE(&dst[0], __UNALIGNED_UINT16_READ(&frame[0]));
    }
    if (len > 0U) {
        dst++[0] = frame++[0];
    }
    
    if (flags & ARM_ETH_MAC_TX_FRAME_FRAGMENT) {
        /* More data to come, remember current write position */
        Emac.frame_end = dst;
        return ARM_DRIVER_OK;
    }
    
    /* Frame is now ready, send it to DMA */
    ctrl = tx_desc[Emac.tx_index].CtrlStat & ~DMA_TX_CIC;
#if (EMAC_CHECKSUM_OFFLOAD != 0)
    if (Emac.tx_cks_offload) {
        /* The following is a workaround for EMAC silicon problem:       */
        /*   "Incorrect layer 3 (L3) checksum is inserted in the sent    */
        /*    IPv4 fragmented packets."                                  */
        /* Description:                                                  */
        /*   When automatic checksum insertion is enabled and the packet */
        /*   is IPv4 frame fragment, then the MAC may incorrectly insert */
        /*   checksum into the packet. This corrupts the payload data    */
        /*   and generates checksum errors at the receiver.              */
        uint16_t prot = __UNALIGNED_UINT16_READ(&tx_desc[Emac.tx_index].Addr[12]);
        uint16_t frag = __UNALIGNED_UINT16_READ(&tx_desc[Emac.tx_index].Addr[20]);
        if ((prot == 0x0008) && (frag & 0xFF3F)) {
            /* Insert only IP header checksum in fragmented frame */
            ctrl |= DMA_TX_CIC_IP;
        } else {
            /* Insert IP header and payload checksums (TCP,UDP,ICMP) */
            ctrl |= DMA_TX_CIC;
        }
    }
#endif
    ctrl &= ~(DMA_TX_IC | DMA_TX_TTSE);
    if (flags & ARM_ETH_MAC_TX_FRAME_EVENT) {
        ctrl |= DMA_TX_IC;
    }
#if (EMAC_TIME_STAMP != 0)
    if (flags & ARM_ETH_MAC_TX_FRAME_TIMESTAMP) { ctrl |= DMA_TX_TTSE; }
    Emac.tx_ts_index = Emac.tx_index;
#endif
    tx_desc[Emac.tx_index].CtrlStat = ctrl | DMA_TX_OWN;
    
    Emac.tx_index++;
    if (Emac.tx_index == NUM_TX_BUF) {
        Emac.tx_index = 0U;
    }
    Emac.frame_end = NULL;
    
    /* Start frame transmission */
    ETH->DMASR = ETH_DMASR_TPSS;
    ETH->DMATPDR = 0U;
    
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t ReadFrame (uint8_t *frame, uint32_t len)
  \brief       Read data of received Ethernet frame.
  \param[in]   frame  Pointer to frame buffer for data to read into
  \param[in]   len    Frame buffer length in bytes
  \return      number of data bytes read or execution status
                 - value >= 0: number of data bytes read
                 - value < 0: error occurred, value is execution status as defined with \ref execution_status 
*/
static int32_t ReadFrame(uint8_t *frame, uint32_t len) {
    uint8_t const *src = rx_desc[Emac.rx_index].Addr;
    int32_t cnt = (int32_t)len;
    
    if ((frame == NULL) && (len != 0U)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    
    /* Fast-copy data to frame buffer */
    for (; len > 7U; frame += 8, src += 8, len -= 8U) {
        __UNALIGNED_UINT32_WRITE(&frame[0], __UNALIGNED_UINT32_READ(&src[0]));
        __UNALIGNED_UINT32_WRITE(&frame[4], __UNALIGNED_UINT32_READ(&src[4]));
    }
    /* Copy remaining 7 bytes */
    for (; len > 1U; frame += 2, src += 2, len -= 2U) {
        __UNALIGNED_UINT16_WRITE(&frame[0], __UNALIGNED_UINT16_READ(&src[0]));
    }
    if (len > 0U) {
        frame[0] = src[0];
    }
    
    /* Return this block back to ETH-DMA */
    rx_desc[Emac.rx_index].Stat = DMA_RX_OWN;
    
    Emac.rx_index++;
    if (Emac.rx_index == NUM_RX_BUF) {
        Emac.rx_index = 0;
    }
    
    if (ETH->DMASR & ETH_DMASR_RBUS) {
        /* Receive buffer unavailable, resume DMA */
        ETH->DMASR = ETH_DMASR_RBUS;
        ETH->DMARPDR = 0;
    }
    return (cnt);
}

/**
  \fn          uint32_t GetRxFrameSize (void)
  \brief       Get size of received Ethernet frame.
  \return      number of bytes in received frame
*/
static uint32_t GetRxFrameSize(void) {
    uint32_t stat = rx_desc[Emac.rx_index].Stat;
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return (0U);
    }
    
    if (stat & DMA_RX_OWN) {
        /* Owned by DMA */
        return (0U);
    }
    if (((stat & DMA_RX_ES) != 0) ||
        ((stat & DMA_RX_FS) == 0) ||
        ((stat & DMA_RX_LS) == 0)) {
        /* Error, this block is invalid */
        return (0xFFFFFFFFU);
    }
    return (((stat & DMA_RX_FL) >> 16) - 4U);
}

/**
  \fn          int32_t GetRxFrameTime (ARM_ETH_MAC_TIME *time)
  \brief       Get time of received Ethernet frame.
  \param[in]   time  Pointer to time structure for data to read into
  \return      \ref execution_status
*/
static int32_t GetRxFrameTime(ARM_ETH_MAC_TIME *time) {
#if (EMAC_TIME_STAMP)
    RX_Desc *rxd = &rx_desc[Emac.rx_index];

    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
      return ARM_DRIVER_ERROR;
    }

    if (rxd->Stat & DMA_RX_OWN) {
      /* Owned by DMA */
      return ARM_DRIVER_ERROR_BUSY;
    }
    time->ns  = rxd->TimeLo;
    time->sec = rxd->TimeHi;

    return ARM_DRIVER_OK;
#else
    (void)time;
    return ARM_DRIVER_ERROR;
#endif
}

/**
  \fn          int32_t GetTxFrameTime (ARM_ETH_MAC_TIME *time)
  \brief       Get time of transmitted Ethernet frame.
  \param[in]   time  Pointer to time structure for data to read into
  \return      \ref execution_status
*/
static int32_t GetTxFrameTime(ARM_ETH_MAC_TIME *time) {
#if (EMAC_TIME_STAMP)
    TX_Desc *txd = &tx_desc[Emac.tx_ts_index];

    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
      return ARM_DRIVER_ERROR;
    }

    if (txd->CtrlStat & DMA_RX_OWN) {
      /* Owned by DMA */
      return ARM_DRIVER_ERROR_BUSY;
    }
    if ((txd->CtrlStat & DMA_TX_TTSS) == 0) {
      /* No transmit time stamp available */
      return ARM_DRIVER_ERROR;
    }
    time->ns  = txd->TimeLo;
    time->sec = txd->TimeHi;
    return ARM_DRIVER_OK;
#else
    (void)time;
    return ARM_DRIVER_ERROR;
#endif
}

/**
  \fn          int32_t ControlTimer (uint32_t control, ARM_ETH_MAC_TIME *time)
  \brief       Control Precision Timer.
  \param[in]   control  operation
  \param[in]   time     Pointer to time structure
  \return      \ref execution_status
*/
static int32_t ControlTimer(uint32_t control, ARM_ETH_MAC_TIME *time) {
#if (EMAC_TIME_STAMP != 0)
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
      return ARM_DRIVER_ERROR;
    }
    if ((control != ARM_ETH_MAC_TIMER_GET_TIME)     &&
        (control != ARM_ETH_MAC_TIMER_SET_TIME)     &&
        (control != ARM_ETH_MAC_TIMER_INC_TIME)     &&
        (control != ARM_ETH_MAC_TIMER_DEC_TIME)     &&
        (control != ARM_ETH_MAC_TIMER_SET_ALARM)    &&
        (control != ARM_ETH_MAC_TIMER_ADJUST_CLOCK)) {
      return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (control) {
      case ARM_ETH_MAC_TIMER_GET_TIME:
        /* Get current time */
        time->sec = ETH->PTPTSHR;
        time->ns  = ETH->PTPTSLR;
        break;

      case ARM_ETH_MAC_TIMER_SET_TIME:
        /* Set new time */
        ETH->PTPTSHUR = time->sec;
        ETH->PTPTSLUR = time->ns;
        /* Initialize TS time */
        ETH->PTPTSCR |= ETH_PTPTSCR_TSSTI;
        break;

      case ARM_ETH_MAC_TIMER_INC_TIME:
        /* Increment current time */
        ETH->PTPTSHUR = time->sec;
        ETH->PTPTSLUR = time->ns;

