zjcszn/mcu-demo/0. zjcszn/st/stm32f4/Middleware/lwip/ports/drv/MAC_STM32F4XX.c
        /* Time stamp system time update */
        ETH->PTPTSCR |=  ETH_PTPTSCR_TSSTU;
        break;

      case ARM_ETH_MAC_TIMER_DEC_TIME:
        /* Decrement current time */
        ETH->PTPTSHUR = time->sec;
        ETH->PTPTSLUR = time->ns | 0x80000000U;

        /* Time stamp system time update */
        ETH->PTPTSCR |=  ETH_PTPTSCR_TSSTU;
        break;

      case ARM_ETH_MAC_TIMER_SET_ALARM:
        /* Set alarm time */
        ETH->PTPTTHR  = time->sec;
        ETH->PTPTTLR  = time->ns;

        /* Enable timestamp interrupt in PTP control */
        ETH->PTPTSCR |= ETH_PTPTSCR_TSITE;

        if (time->sec || time->ns) {
          /* Enable timestamp trigger interrupt */
          ETH->MACIMR &= ~ETH_MACIMR_TSTIM;
        } else {
          /* Disable timestamp trigger interrupt */
          ETH->MACIMR |= ETH_MACIMR_TSTIM;
        }
        break;

      case ARM_ETH_MAC_TIMER_ADJUST_CLOCK:
        /* Adjust current time, fine correction */
        /* Correction factor is Q31 (0x80000000 = 1.000000000) */
        ETH->PTPTSAR = (uint32_t)(((uint64_t)time->ns * ETH->PTPTSAR) >> 31);
        /* Fine TS clock correction */
        ETH->PTPTSCR |= ETH_PTPTSCR_TSARU;
        break;
    }
    return ARM_DRIVER_OK;
#else
    (void)control;
    (void)time;
    return ARM_DRIVER_ERROR;
#endif
}

/**
  \fn          int32_t Control (uint32_t control, uint32_t arg)
  \brief       Control Ethernet Interface.
  \param[in]   control  operation
  \param[in]   arg      argument of operation (optional)
  \return      \ref execution_status
*/
static int32_t Control(uint32_t control, uint32_t arg) {
    uint32_t maccr;
    uint32_t dmaomr;
    uint32_t macffr;
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    if ((control != ARM_ETH_MAC_CONFIGURE) &&
        (control != ARM_ETH_MAC_CONTROL_TX) &&
        (control != ARM_ETH_MAC_CONTROL_RX) &&
        (control != ARM_ETH_MAC_FLUSH) &&
        (control != ARM_ETH_MAC_SLEEP) &&
        (control != ARM_ETH_MAC_VLAN_FILTER)) {
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    
    switch (control) {
        case ARM_ETH_MAC_CONFIGURE:
            maccr = ETH->MACCR & ~(ETH_MACCR_FES | ETH_MACCR_DM |
                ETH_MACCR_LM | ETH_MACCR_IPCO);
            
            /* Configure 100MBit/10MBit mode */
            switch (arg & ARM_ETH_MAC_SPEED_Msk) {
                case ARM_ETH_MAC_SPEED_10M:
#if (ETH_MII == 0)
                    /* RMII Half Duplex Colision detection does not work */
                    maccr |= ETH_MACCR_DM;
#endif
                    break;
                case ARM_ETH_SPEED_100M:
                    maccr |= ETH_MACCR_FES;
                    break;
                default:
                    return ARM_DRIVER_ERROR_UNSUPPORTED;
            }
            
            /* Confige Half/Full duplex mode */
            switch (arg & ARM_ETH_MAC_DUPLEX_Msk) {
                case ARM_ETH_MAC_DUPLEX_FULL:
                    maccr |= ETH_MACCR_DM;
                    break;
                case ARM_ETH_MAC_DUPLEX_HALF:
                    break;
                default:
                    return ARM_DRIVER_ERROR;
            }
            
            /* Configure loopback mode */
            if (arg & ARM_ETH_MAC_LOOPBACK) {
                maccr |= ETH_MACCR_LM;
            }
            
            dmaomr = ETH->DMAOMR & ~(ETH_DMAOMR_RSF | ETH_DMAOMR_TSF | ETH_DMAOMR_DTCEFD | ETH_DMAOMR_FEF);
            
            /* All frames except runt error frames are forwarded to the DMA. */
            if (arg & ARM_ETH_MAC_FORWARD_ERROR_FRAME) {
                dmaomr |= ETH_DMAOMR_FEF;
            }
            
            /* Don't drop frames that only have errors detected by the receive checksum offload engine*/
            if (arg & ARM_ETH_MAC_DISABLE_DROP_ERROR_FRAME) {
                dmaomr |= ETH_DMAOMR_DTCEFD;
            }

#if (EMAC_CHECKSUM_OFFLOAD != 0)
            /* Enable rx checksum verification */
            if (arg & ARM_ETH_MAC_CHECKSUM_OFFLOAD_RX) {
                maccr |= ETH_MACCR_IPCO;
                dmaomr |= ETH_DMAOMR_RSF;
            }
            
            /* Enable tx checksum generation */
            if (arg & ARM_ETH_MAC_CHECKSUM_OFFLOAD_TX) {
                dmaomr |= ETH_DMAOMR_TSF;
                Emac.tx_cks_offload = true;
            } else {
                Emac.tx_cks_offload = false;
            }
#else
            if ((arg & ARM_ETH_MAC_CHECKSUM_OFFLOAD_RX) ||
                (arg & ARM_ETH_MAC_CHECKSUM_OFFLOAD_TX)) {
              /* Checksum offload is disabled in the driver */
              return ARM_DRIVER_ERROR;
            }
#endif
            ETH->DMAOMR = dmaomr;
            ETH->MACCR = maccr;
            
            macffr = ETH->MACFFR & ~(ETH_MACFFR_PM | ETH_MACFFR_PAM | ETH_MACFFR_BFD);
            /* Enable broadcast frame receive */
            if ((arg & ARM_ETH_MAC_ADDRESS_BROADCAST) == 0) {
                macffr |= ETH_MACFFR_BFD;
            }
            
            /* Enable all multicast frame receive */
            if (arg & ARM_ETH_MAC_ADDRESS_MULTICAST) {
                macffr |= ETH_MACFFR_PAM;
            }
            
            /* Enable promiscuous mode (no filtering) */
            if (arg & ARM_ETH_MAC_ADDRESS_ALL) {
                macffr |= ETH_MACFFR_PM;
            }
            ETH->MACFFR = macffr;
            break;
        
        case ARM_ETH_MAC_CONTROL_TX:
            /* Enable/disable MAC transmitter */
            maccr = ETH->MACCR & ~ETH_MACCR_TE;
            dmaomr = ETH->DMAOMR & ~ETH_DMAOMR_ST;
            if (arg != 0) {
                init_dma();
                maccr |= ETH_MACCR_TE;
                dmaomr |= ETH_DMAOMR_ST;
            }
            ETH->MACCR = maccr;
            ETH->DMAOMR = dmaomr;
            break;
        
        case ARM_ETH_MAC_CONTROL_RX:
            /* Enable/disable MAC receiver */
            maccr = ETH->MACCR & ~ETH_MACCR_RE;
            dmaomr = ETH->DMAOMR & ~ETH_DMAOMR_SR;
            if (arg != 0) {
                init_dma();
                maccr |= ETH_MACCR_RE;
                dmaomr |= ETH_DMAOMR_SR;
            }
            ETH->MACCR = maccr;
            ETH->DMAOMR = dmaomr;
            break;
        
        case ARM_ETH_MAC_FLUSH:
            /* Flush tx and rx buffers */
            if (arg & ARM_ETH_MAC_FLUSH_RX) {
            }
            if (arg & ARM_ETH_MAC_FLUSH_TX) {
                ETH->DMAOMR |= ETH_DMAOMR_FTF;
            }
            break;
        
        case ARM_ETH_MAC_VLAN_FILTER:
            /* Configure VLAN filter */
            ETH->MACVLANTR = arg;
            break;
    }
    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t PHY_Read (uint8_t phy_addr, uint8_t reg_addr, uint16_t *data)
  \brief       Read Ethernet PHY Register through Management Interface.
  \param[in]   phy_addr  5-bit device address
  \param[in]   reg_addr  5-bit register address
  \param[out]  data      Pointer where the result is written to
  \return      \ref execution_status
*/
static int32_t PHY_Read(uint8_t phy_addr, uint8_t reg_addr, uint16_t *data) {
    uint32_t val, tick;
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    
    val = ETH->MACMIIAR & ETH_MACMIIAR_CR;
    
    ETH->MACMIIAR = val | ETH_MACMIIAR_MB | ((uint32_t)phy_addr << 11) |
        ((uint32_t)reg_addr << 6);
    
    /* Wait until operation completed */
    tick = HAL_GetTick();
    do {
        if ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == 0U) {
            break;
        }
    } while ((HAL_GetTick() - tick) < PHY_TIMEOUT);
    
    if ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == 0U) {
        *data = ETH->MACMIIDR & ETH_MACMIIDR_MD;
        return ARM_DRIVER_OK;
    }
    
    return ARM_DRIVER_ERROR_TIMEOUT;
}

/**
  \fn          int32_t PHY_Write (uint8_t phy_addr, uint8_t reg_addr, uint16_t data)
  \brief       Write Ethernet PHY Register through Management Interface.
  \param[in]   phy_addr  5-bit device address
  \param[in]   reg_addr  5-bit register address
  \param[in]   data      16-bit data to write
  \return      \ref execution_status
*/
static int32_t PHY_Write(uint8_t phy_addr, uint8_t reg_addr, uint16_t data) {
    uint32_t val, tick;
    
    if ((Emac.flags & EMAC_FLAG_POWER) == 0U) {
        return ARM_DRIVER_ERROR;
    }
    
    ETH->MACMIIDR = data;
    val = ETH->MACMIIAR & ETH_MACMIIAR_CR;
    ETH->MACMIIAR = val | ETH_MACMIIAR_MB | ETH_MACMIIAR_MW | ((uint32_t)phy_addr << 11) |
        ((uint32_t)reg_addr << 6);
    
    /* Wait until operation completed */
    tick = HAL_GetTick();
    do {
        if ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == 0U) {
            break;
        }
    } while ((HAL_GetTick() - tick) < PHY_TIMEOUT);
    
    if ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == 0U) {
        return ARM_DRIVER_OK;
    }
    
    return ARM_DRIVER_ERROR_TIMEOUT;
}

/* Ethernet IRQ Handler */
void ETH_IRQHandler(void) {
    uint32_t dmasr, macsr, event = 0;
    
    dmasr = ETH->DMASR;
    ETH->DMASR = dmasr & (ETH_DMASR_NIS | ETH_DMASR_RS | ETH_DMASR_TS);
    
    if (dmasr & ETH_DMASR_TS) {
        /* Frame sent */
        event |= ARM_ETH_MAC_EVENT_TX_FRAME;
    }
    if (dmasr & ETH_DMASR_RS) {
        /* Frame received */
        event |= ARM_ETH_MAC_EVENT_RX_FRAME;
    }
    macsr = ETH->MACSR;

#if (EMAC_TIME_STAMP != 0)
    if (macsr & ETH_MACSR_TSTS) {
      /* Timestamp interrupt */
      if (ETH->PTPTSSR & 2U /*ETH_PTPTSSR_TSTTR*/) {
        /* Time stamp target time reached */
        event |= ARM_ETH_MAC_EVENT_TIMER_ALARM;
      }
    }
#endif
    if (macsr & ETH_MACSR_PMTS) {
        ETH->MACPMTCSR;
        event |= ARM_ETH_MAC_EVENT_WAKEUP;
    }
    
    /* Callback event notification */
    if (event && Emac.cb_event) {
        Emac.cb_event(event);
    }
}

/* MAC Driver Control Block */
ARM_DRIVER_ETH_MAC Driver_ETH_MAC0 = {
    GetVersion,
    GetCapabilities,
    Initialize,
    Uninitialize,
    PowerControl,
    GetMacAddress,
    SetMacAddress,
    SetAddressFilter,
    SendFrame,
    ReadFrame,
    GetRxFrameSize,
    GetRxFrameTime,
    GetTxFrameTime,
    ControlTimer,
    Control,
    PHY_Read,
    PHY_Write
};

/*! \endcond */
